artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 40
      arrivalRate: 2
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            username: "Test-User"
            email: "test@example.com"
            password: "Password123"
      # - post: 
      #     url: "/posts"
      #     json:
      #       title: "artillery blog post"
      #       body: "isnt this a frog based blog"